{
    "motivationalUpdates": [
      {
        "id": 1,
        "message": "Every step you take brings you closer to your goals. Keep moving forward!"
      },
      {
        "id": 2,
        "message": "Consistency is the key to success. You're doing great!"
      },
      {
        "id": 3,
        "message": "Progress, not perfection. Celebrate every small win!"
      },
      {
        "id": 4,
        "message": "You are stronger than you think. Keep pushing!"
      },
      {
        "id": 5,
        "message": "Small steps every day lead to big results over time."
      },
      {
        "id": 6,
        "message": "Your hard work is paying off. Keep it up!"
      },
      {
        "id": 7,
        "message": "Believe in yourself. You've got this!"
      },
      {
        "id": 8,
        "message": "Every workout is a step closer to your best self."
      },
      {
        "id": 9,
        "message": "You're making progress, even if it doesn't feel like it."
      },
      {
        "id": 10,
        "message": "Stay focused and keep grinding. Success is on the way!"
      },
      {
        "id": 11,
        "message": "You're capable of more than you know. Keep going!"
      },
      {
        "id": 12,
        "message": "Every drop of sweat is a step toward your goals."
      },
      {
        "id": 13,
        "message": "You're building habits that will last a lifetime. Keep it up!"
      },
      {
        "id": 14,
        "message": "The only bad workout is the one you didn't do. Great job today!"
      },
      {
        "id": 15,
        "message": "You're stronger than your excuses. Keep pushing!"
      },
      {
        "id": 16,
        "message": "Every day is a new opportunity to improve. Seize it!"
      },
      {
        "id": 17,
        "message": "You're not just building a body; you're building a better life."
      },
      {
        "id": 18,
        "message": "Progress takes time, but you're on the right track!"
      },
      {
        "id": 19,
        "message": "You're one step closer to your goals than you were yesterday."
      },
      {
        "id": 20,
        "message": "Stay committed to your goals. You're doing amazing!"
      },
      {
        "id": 21,
        "message": "Your effort today is an investment in your future self."
      },
      {
        "id": 22,
        "message": "You're unstoppable when you believe in yourself."
      },
      {
        "id": 23,
        "message": "Every rep, every step, every choice matters. Keep going!"
      },
      {
        "id": 24,
        "message": "You're creating a healthier, happier version of yourself."
      },
      {
        "id": 25,
        "message": "Success is the sum of small efforts repeated daily."
      },
      {
        "id": 26,
        "message": "You're capable of amazing things. Keep believing!"
      },
      {
        "id": 27,
        "message": "Every challenge is an opportunity to grow. Embrace it!"
      },
      {
        "id": 28,
        "message": "You're making progress, one day at a time. Keep it up!"
      },
      {
        "id": 29,
        "message": "Your dedication is inspiring. Keep shining!"
      },
      {
        "id": 30,
        "message": "You're on the path to greatness. Don't stop now!"
      }
    ]
  }